Autodesk.Revit.DB.Profile.transformGPolyCurve(GPolyCurve*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Trf!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Transforms all curves in the specified polycurve.

Autodesk.Revit.DB.Profile.Clone
Returns a copy of this profile.

Autodesk.Revit.DB.Profile.Transformed(Autodesk.Revit.DB.Transform)
Transforms this profile and returns the result.
transform: The transformation used to transform the profile.
Returns: The transformed profile.
Remarks: Transforms all the curves that define the boundary of this profile.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the handle of the specified transformation is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to transform a curve in the profile.

Autodesk.Revit.DB.Profile.Curves
Retrieve the curves that make up the boundary of the profile.

Autodesk.Revit.DB.Profile.Filled
Get or set whether the profile is filled.

Autodesk.Revit.DB.Profile
A geometric profile consisting of a loop of curves.
Remarks: The profile may be filled.